Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: =head1 NAME X<function>
es_es: =head1 NOMBRE X<función>

source: perlfunc - Perl builtin functions
es_es: perlfunc - Funciones incluídas en Perl

source: =head1 DESCRIPTION
es_es: =head1 DESCRIPCIÓN

source: The functions in this section can serve as terms in an expression.
es_es: Las funciones de esta sección pueden servir como términos en una expresión.

source: They fall into two major categories: list operators and named unary operators.
es_es: Se agrupan en dos categorías principales: operadores de listas y operadores unarios con nombre.

source: These differ in their precedence relationship with a following comma.
es_es: Difieren en su relación de precedencia cuando son seguidos por una coma.

source: (See the precedence table in L<perlop>.) List operators take more than one argument, while unary operators can never take more than one argument.
es_es: (Ver la tabla de precedencia en L<perlop>.) Los operadores de listas toman más de un argumento, mientras que los operadores unarios nunca toman más de un argumento.

source: Thus, a comma terminates the argument of a unary operator, but merely separates the arguments of a list operator.
es_es: Así, una coma determina al argumento de un operador unario, pero sólo sirve de separación entre argumentos en un operador de listas.

source: A unary operator generally provides a scalar context to its argument, while a list operator may provide either scalar or list contexts for its arguments.
es_es: Un operador unario generalmente proveé de un contexto escalar a su argumento, mientras que un operador de listas puede proveer tanto de un contexto escalar como un contexto de lista, a sus argumentos.

source: If it does both, the scalar arguments will be first, and the list argument will follow.
es_es: Si aparecen ambos, los argumentos escalares van antes que los argumentos de listas.

source: (Note that there can ever be only one such list argument.) For instance, splice() has three scalar arguments followed by a list, whereas gethostbyname() has four scalar arguments.
es_es: (Note aquí que sólo puede aparecer un argumento de lista). Por ejemplo, splice() tiene tres argumentos escalares seguidos por una lista, mientras que gethostbyname() tiene cuatro argumentos.

source: In the syntax descriptions that follow, list operators that expect a list (and provide list context for the elements of the list) are shown with LIST as an argument.
es_es: En las descripciones sintácticas que siguen a continuación, los operadores de listas que esperan una lista (y proveen de un contexto lista para los elementos de la lista) se muestran con un argumento así: LISTA.

source: Such a list may consist of any combination of scalar arguments or list values; the list values will be included in the list as if each individual element were interpolated at that point in the list, forming a longer single-dimensional list value.
es_es: Tal lista puede consistir en cualquier combinación de argumentos escalares o valores de lista; los valores de lista serán incluidos en la lista como si cada elemento individual fuera interpolado en ese punto en la lista, formando un largo y unidimensional valor de lista.

source: Commas should separate elements of the LIST.
es_es: Las comas deberían separar elementos de la LISTA.

source: Any function in the list below may be used either with or without parentheses around its arguments.
es_es: Cualquier función en la lista de abajo puede ser usada tanto con paréntesis como sin ellos alrededor de sus argumentos.

source: (The syntax descriptions omit the parentheses.) If you use the parentheses, the simple (but occasionally surprising) rule is this: It I<looks> like a function, therefore it I<is> a function, and precedence doesn't matter.
es_es: (Las descripciones sintácticas omiten los paréntesis). Si usa los paréntesis, la simple (pero ocasionalmente sorprendente) regla es esta: Si I<se parece> a una función, por eso I<es> una función y la precedencia no importará.

source: Otherwise it's a list operator or unary operator, and precedence does matter.
es_es: De lo contrario es un operador de lista u operador unario, y la precedencia sí importa.

source: And whitespace between the function and left parenthesis doesn't count--so you need to be careful sometimes:
es_es: Y el espacio en blanco entre la función y el paréntesis izquierdo no cuenta, por lo que deberá tener cuidado algunas veces:

source: print 1+2+4; # Prints 7.
es_es: print 1+2+4; # Imprime 7.

source: print(1+2) + 4; # Prints 3.
es_es: print(1+2) + 4; # Imprime 3.

source: print (1+2)+4; # Also prints 3!
es_es: print (1+2)+4; # ¡También imprime 3!

source: print +(1+2)+4; # Prints 7.
es_es: print +(1+2)+4; # Imprime 7.

source: print ((1+2)+4); # Prints 7.
es_es: print ((1+2)+4); # Imprime 7.

source: If you run Perl with the B<-w> switch it can warn you about this.
es_es: Si corre Perl con la opción B<-w> le avisará sobre todo esto.

source: For example, the third line above produces:
es_es: Por ejemplo, la tercera línea de arriba produce:

source: print (...) interpreted as function at - line 1.
es_es: print (...) interpreted as function at - line 1. (print (...) interpretado como función en - línea 1)

source: Useless use of integer addition in void context at - line 1.
es_es: Useless use of integer addition in void context at - line 1. (Inútil uso de suma de enteros en contexto void en - línea 1)

source: A few functions take no arguments at all, and therefore work as neither unary nor list operators.
es_es: Unas pocas funciones no toman ningún argumento, por lo que funcionan tando como operadores unarios como operadores de lista.

source: These include such functions as C<time> and C<endpwent>.
es_es: Estas incluyen funciones como C<time> y C<endpwent>.

source: For example, C<time+86_400> always means C<time() + 86_400>.
es_es: Por ejemplo, C<time+86_400> siempre significa C<time() + 86_400>.

source: For functions that can be used in either a scalar or list context, nonabortive failure is generally indicated in a scalar context by returning the undefined value, and in a list context by returning the null list.
es_es: Para funciones que pueden ser usadas tanto en contexto escalar como en lista, un fallo no abortivo es indicado generalmente devolviendo el valor indefinido, y en contexto lista devolviendo la lista nula.

source: Remember the following important rule: There is B<no rule> that relates the behavior of an expression in list context to its behavior in scalar context, or vice versa.
es_es: Recuerde la siguiente regla importante: B<No hay regla> que relacione el comportamiento de una expresión en contexto lista a su comportamiento en contexto escalar, o viceversa.

source: It might do two totally different things.
es_es: Puede hacer dos cosas totalmente diferentes.

source: Each operator and function decides which sort of value it would be most appropriate to return in scalar context.
es_es: Cada operador y función decide qué clase de valor será más apropiado para devolver en contexto escalar.

source: Some operators return the length of the list that would have been returned in list context.
es_es: Algunos operadores devuelven la longitud de la lista que se hubiera devuelto en contexto lista.

source: Some operators return the first value in the list.
es_es: Algunos operadores devuelven el primer valor de la lista.

source: Some operators return the last value in the list.
es_es: Algunos operadores devuelven el último valor de la lista.

source: Some operators return a count of successful operations.
es_es: Algunos operadores devuelven una cuenta del número de operaciones exitosas.

source: In general, they do what you want, unless you want consistency.
es_es: En general, ellos hacen lo que usted busca, a menos que busque la coherencia.

source: X<context>
es_es: X<contexto>

source: A named array in scalar context is quite different from what would at first glance appear to be a list in scalar context.
es_es: Un array con nombre en contexto escalar es muy diferente de lo que en un primer vistazo pudiera ser una lista en contexto escalar.

source: You can't get a list like C<(1,2,3)> into being in scalar context, because the compiler knows the context at compile time.
es_es: No puede conseguir que una lista como C<(1,2,3)> se convierta en contexto escalar porque el compilador conoce el contexto en tiempo de compilación.

source: It would generate the scalar comma operator there, not the list construction version of the comma.
es_es: Generará aquí el operador coma, no la versión de construcción de listas.

source: That means it was never a list to start with.
es_es: Esto significa que nunca será una lista.

source: In general, functions in Perl that serve as wrappers for system calls of the same name (like chown(2), fork(2), closedir(2), etc.) all return true when they succeed and C<undef> otherwise, as is usually mentioned in the descriptions below.
es_es: En general, funciones en Perl que sirven como envoltorios para llamadas al sistema del mismo nombre (como chown(2), fork(2), closedir(2), etc.) todas ellas devuelven verdadero cuando tienen éxito y C<undef> en otro caso, como se menciona en las descripciones de más abajo.

source: This is different from the C interfaces, which return C<-1> on failure.
es_es: Esto es diferente de las interfaces C, que devuelven C<-1> en caso de fallo.

source: Exceptions to this rule are C<wait>, C<waitpid>, and C<syscall>.
es_es: Excepciones a esta regla son C<wait>, C<waitpid> y C<syscall>.

source: System calls also set the special C<$!> variable on failure.
es_es: Llamadas al sistema también actualizan la variable especial C<$!> en caso de fallo.

source: Other functions do not, except accidentally.
es_es: Otras funciones no, excepto accidentalmente.

source: =head2 Perl Functions by Category X<function>
es_es: =head2 Funciones Perl por Categoría X<función>

source: Here are Perl's functions (including things that look like functions, like some keywords and named operators) arranged by category.
es_es: Aquí están las funciones Perl (incluyen cosas que parecen funciones, como algunas palabras clave y operadores con nombre) agrupados por categoría.

source: Some functions appear in more than one place.
es_es: Algunas funciones aparecen en más de un sitio.

source: =item Functions for SCALARs or strings X<scalar> X<string> X<character>
es_es: =item Funciones para ESCALARES o strings X<escalar> X<string> X<carácter> X<caracteres>

source: =item Regular expressions and pattern matching X<regular expression> X<regex> X<regexp>
es_es: =item Expresiones Regulares y coincidencia de patrones X<expresión regular> X<regex> X<regexp>

source: =item Numeric functions X<numeric> X<number> X<trigonometric> X<trigonometry>
es_es: =item Funciones Numéricas X<numérico> X<numérica> X<número> X<trigonométrico> X<trigonometría>

source: =item Functions for real @ARRAYs X<array>
es_es: =item Funciones para @ARRAY verdaderos X<array>

source: =item Functions for list data X<list>
es_es: =item Funciones para listas de datos X<lista>

source: =item Functions for real %HASHes X<hash>
es_es: =item Funciones para %HASH verdaderos X<hash>

source: =item Input and output functions X<I/O> X<input> X<output> X<dbm>
es_es: =item Funciones de entrada y salida X<I/O> X<input> X<output> X<dbm> X<entrada> X<salida>

source: =item Functions for fixed length data or records
es_es: =item Funciones para datos de longitud fija o registros

source: =item Functions for filehandles, files, or directories X<file> X<filehandle> X<directory> X<pipe> X<link> X<symlink>
es_es: =item Functones para manejadores de archivos, ficheros o directorios X<fichero> X<manejador> X<directorio> X<pipe> X<link> X<symlink>

source: =item Keywords related to the control flow of your Perl program X<control flow>
es_es: =item Palabras clave relativas al control de flujo de su programa Perl X<control de flujo>

source: =item Keywords related to scoping
es_es: =item Palabras clave relacionadas con el ámbito

source: =item Miscellaneous functions
es_es: =item Funciones Varias

source: =item Functions for processes and process groups X<process> X<pid> X<process id>
es_es: =item Funciones para procesos y grupos de procesos X<proceso> X<pid> X<proceso id>

source: =item Keywords related to perl modules X<module>
es_es: =item Palabras clave relacionadas con módulos perl X<módulo>

source: =item Keywords related to classes and object-orientedness X<object> X<class> X<package>
es_es: =item Palabras clave relacionadas a clases y orientado a objetos X<objeto> X<clase> X<package> X<paquete>

source: =item Low-level socket functions X<socket> X<sock>
es_es: =item Funciones de socket de bajo nivel X<socket> X<sock>

source: =item System V interprocess communication functions X<IPC> X<System V> X<semaphore> X<shared memory> X<memory> X<message>
es_es: =item Funciones de comunicación de interprocesos System V X<IPC> X<System V> X<semáforo> X<memoria compartida> X<memoria> X<mensaje>

source: =item Fetching user and group info X<user> X<group> X<password> X<uid> X<gid> X<passwd> X</etc/passwd>
es_es: =item Obteniendo información del usuario y grupo X<usuario> X<grupo> X<password> X<contraseña> X<uid> X<gid> X<passwd> X</etc/passwd>

source: =item Fetching network info X<network> X<protocol> X<host> X<hostname> X<IP> X<address> X<service>
es_es: =item Obteniendo información de la red X<network> X<red> X<protocolo> X<host> X<hostname> X<IP> X<dirección> X<servicio>

source: =item Time-related functions X<time> X<date>
es_es: =item Funciones relacionadas con el Tiempo X<tiempo> X<fecha>

source: =item Functions new in perl5 X<perl5>
es_es: =item Funciones nuevas en perl5 X<perl5>

source: * - C<sub> was a keyword in perl4, but in perl5 it is an operator, which can be used in expressions.
es_es: * - C<sub> era una palabra clave en perl4, pero en perl5 es un operador, por lo cual puede ser usado con paréntesis.

source: =item Functions obsoleted in perl5
es_es: =item Funciones obsoletas en perl5

source: =head2 Portability X<portability> X<Unix> X<portable>
es_es: =head2 Portabilidad X<portabilidad> X<adaptación> X<Unix> X<portable>

source: Perl was born in Unix and can therefore access all common Unix system calls.
es_es: Perl nació en Unix y por eso puede acceder a todas las llamadas normales del sistema Unix.

source: In non-Unix environments, the functionality of some Unix system calls may not be available, or details of the available functionality may differ slightly.
es_es: En entornos no Unix, la funcionalidad de algunas llamadas del sistema Unix pueden no estar disponibles, o los detalles de la funcionalidad disponible diferir ligeramente.

source: The Perl functions affected by this are:
es_es: Las funciones Perl afectadas por esto son:

source: For more information about the portability of these functions, see L<perlport> and other available platform-specific documentation.
es_es: Para más información sobre la portabilidad de estas funciones, ver L<perlport> y otra documentación específica de la plataforma que esté disponible.

source: =head2 Alphabetical Listing of Perl Functions
es_es: =head2 Listado alfabético de las funciones Perl

source: =item -X FILEHANDLE X<-r>X<-w>X<-x>X<-o>X<-R>X<-W>X<-X>X<-O>X<-e>X<-z>X<-s>X<-f>X<-d>X<-l>X<-p> X<-S>X<-b>X<-c>X<-t>X<-u>X<-g>X<-k>X<-T>X<-B>X<-M>X<-A>X<-C>
es_es: =item -X MANEJADOR X<-r>X<-w>X<-x>X<-o>X<-R>X<-W>X<-X>X<-O>X<-e>X<-z>X<-s>X<-f>X<-d>X<-l>X<-p> X<-S>X<-b>X<-c>X<-t>X<-u>X<-g>X<-k>X<-T>X<-B>X<-M>X<-A>X<-C>

source: A file test, where X is one of the letters listed below.
es_es: Un test de fichero, donde X es una de las letras listadas abajo.

source: This unary operator takes one argument, either a filename or a filehandle, and tests the associated file to see if something is true about it.
es_es: Este operador unario toma un argumento, un nombre de fichero o un manejador, y testea el fichero asociado para ver si algo sobre él es cierto.

source: If the argument is omitted, tests C<$_>, except for C<-t>, which tests STDIN.
es_es: Si el argumento está omitido, se testea C<$_>, excepto para C<-t>, que testea STDIN.

source: Unless otherwise documented, it returns C<1> for true and C<''> for false, or the undefined value if the file doesn't exist.
es_es: Mientras no se diga lo contrario, devuelve C<1> para verdadero y C<''> para falso, o el valor indefinido si el fichero no existe.

source: Despite the funny names, precedence is the same as any other named unary operator, and the argument may be parenthesized like any other unary operator.
es_es: A pesar de los nombres graciosos, la precedencia es la misma que en cualquier otro operador unario y el argumento puede ser rodeado por paréntesis como cualquier otro operador unario.

source: The operator may be any of:
es_es: El operador puede ser cualquier de:

source: -r File is readable by effective uid/gid.
es_es: -r Fichero es leíble por el uid/gid en vigor.

source: -w File is writable by effective uid/gid.
es_es: -w Fichero es escribible por el uid/gid en vigor.

source: -x File is executable by effective uid/gid.
es_es: -x Fichero es ejecutable por el uid/gid en vigor.

source: -o File is owned by effective uid.
es_es: -o Fichero es propiedad del uid en vigor.

source: -R File is readable by real uid/gid.
es_es: -R Fichero es leíble por el uid/gid real.

source: -W File is writable by real uid/gid.
es_es: -W Fichero es escribible por el uid/gid real.

source: -X File is executable by real uid/gid.
es_es: -X Fichero es ejecutable por el uid/gid real.

source: -O File is owned by real uid.
es_es: -O Fichero es propiedad del uid real.

source: -e File exists.
es_es: -e Fichero existe.

source: -z File has zero size (is empty).
es_es: -z Fichero tiene tamaño cero (está vacío).

source: -s File has nonzero size (returns size in bytes).
es_es: -s Fichero no tiene tamaño cero (devuelve el tamaño en bytes).

source: -f File is a plain file.
es_es: -f Fichero es un fichero normal.

source: -d File is a directory.
es_es: -d Fichero es un directorio.

source: -l File is a symbolic link.
es_es: -l Fichero es un enlace simbólico.

source: -p File is a named pipe (FIFO), or Filehandle is a pipe.
es_es: -p Fichero es una tubería con nombre (FIFO), o el manejador es una tubería.

source: -S File is a socket.
es_es: -S Fichero es un socket.

source: -b File is a block special file.
es_es: -b Fichero es un archivo especial por bloques.

source: -c File is a character special file.
es_es: -c Fichero es un archivo especial de caracteres.

source: -t Filehandle is opened to a tty.
es_es: -t Manejador está abierto a una tty.

source: -u File has setuid bit set.
es_es: -u Fichero tiene puesto el bit setuid.

source: -g File has setgid bit set.
es_es: -g Fichero tiene puesto el bit setgid.

source: -k File has sticky bit set.
es_es: -k Fichero tiene puesto el bit sticky.

source: -T File is an ASCII text file (heuristic guess).
es_es: -T Fichero es un fichero de texto ASCII (suposición heurística).

source: -B File is a "binary" file (opposite of -T).
es_es: -B Fichero es un archivo "binario" (opuesto de -T).

source: -M Script start time minus file modification time, in days.
es_es: -M Tiempo de modificación del fichero menos el tiempo de arranque del script, en días.

source: -A Same for access time.
es_es: -A Lo mismo para el tiempo de acceso.

source: -C Same for inode change time (Unix, may differ for other platforms)
es_es: -C Lo mismo para el cambio de la fecha del inodo (Unix, puede diferir en otras plataformas)

source: Example:
es_es: Ejemplo:

source: while (<>) { chomp; next unless -f $_; # ignore specials #...
es_es: while (<>) { chomp; next unless -f $_; # ignora especiales #...

source: The interpretation of the file permission operators C<-r>, C<-R>, C<-w>, C<-W>, C<-x>, and C<-X> is by default based solely on the mode of the file and the uids and gids of the user.
es_es: La interpretación de los operadores de permisos de fichero C<-r>, C<-R>, C<-w>, C<-W>, C<-x> y C<-X> es por defecto basado sólamente en el modo del fichero y en los uid y gid del usuario.

source: There may be other reasons you can't actually read, write, or execute the file.
es_es: Puede haber otras razones por las que no pueda leer, escribir o ejecutar un fichero.

source: Such reasons may be for example network filesystem access controls, ACLs (access control lists), read-only filesystems, and unrecognized executable formats.
es_es: Esas razones pueden ser por ejemplo controles de acceso a sistemas de ficheros en red, ACL (listas de control de acceso), sistemas de ficheros de sólo lectura y formatos de ejecutables no reconocibles.

source: Also note that, for the superuser on the local filesystems, the C<-r>, C<-R>, C<-w>, and C<-W> tests always return 1, and C<-x> and C<-X> return 1 if any execute bit is set in the mode.
es_es: También note que, para el superusuario en el sistema de ficheros local, los test C<-r>, C<-R>, C<-w> y C<-W> siempre devuelven 1, y C<-x> y C<-X> devuelven 1 si cualquier bit de ejecución está puesto en el modo.

source: Scripts run by the superuser may thus need to do a stat() to determine the actual mode of the file, or temporarily set their effective uid to something else.
es_es: Scripts ejecutados por el superusuario pueden necesitar hacer un stat() para determinar el modo actual del fichero, o temporalmente poner su uid efectivo a otro valor.

source: If you are using ACLs, there is a pragma called C<filetest> that may produce more accurate results than the bare stat() mode bits.
es_es: Si está usando ACL, hay un pragma llamado C<filetest> que puede producir resultados más precisos que los simples bits de modo de stat().

source: When under the C<use filetest 'access'> the above-mentioned filetests will test whether the permission can (not) be granted using the access() family of system calls.
es_es: Cuando esté bajo 'acceso' por <use filetest> los test de fichero mencionados arriba testearán cuándo los permisos pueden (o no) ser concedidos usando la familia de llamadas del sistema access().

source: Also note that the C<-x> and C<-X> may under this pragma return true even if there are no execute permission bits set (nor any extra execute permission ACLs).
es_es: También note que C<-x> y C<-X> pueden bajo este pragma devolver valores verdaderos incluso si los bits de permiso de ejecución no están puestos (ni cualquier permiso ACL extra de ejecución).

source: This strangeness is due to the underlying system calls' definitions.
es_es: Este comportamiento tan extraño es debido a las definiciones subyacentes de las llamadas del sistema.

source: Read the documentation for the C<filetest> pragma for more information.
es_es: Lea la documentación para el pragma C<filetest> para más información.

source: Note that C<-s/a/b/> does not do a negated substitution.
es_es: Note que C<-s/a/b/> no realiza una substitución negada.

source: Saying C<-exp($foo)> still works as expected, however--only single letters following a minus are interpreted as file tests.
es_es: Diciendo C<-exp($foo)> todavía funciona como se espera; sólo letras sueltas siguiendo a un menos son interpretadas como test de ficheros.

source: The C<-T> and C<-B> switches work as follows.
es_es: Las opciones C<-T> y C<-B> funcionan como sigue.

source: The first block or so of the file is examined for odd characters such as strange control codes or characters with the high bit set.
es_es: El primer bloque o así del fichero es examinado para buscar extraños caracteres como códigos de control o caracteres con el bit alto puesto.

source: If too many strange characters (>30%) are found, it's a C<-B> file; otherwise it's a C<-T> file.
es_es: Si se encuentran demasiados caracteres extraños (>30%), es un fichero C<-B>; de lo contrario es un fichero C<-T>.
